app/Controllers/Client.php

    public function index()
    {
        $data = [
            'title' => "Home",
            'categories' => $this->categoriesModel->findAll(),
            'voucher' => $this->voucherModel->findAll(),
---
SELECT *
FROM `categories`
SELECT *
FROM `voucher`

    public function searchGameSession()
    {
        if ($this->request->getPost('gamename')) {
            $gamename = $this->request->getPost();
            $db      = \Config\Database::connect();
            $builder = $db->table('categories');
            try {
                $builder->havingLike('category', $gamename['gamename']);
                $game = $builder->get()->getResult()[0]->id_category;
---
SELECT *
FROM `categories`
HAVING `category` LIKE '%mobil%' ESCAPE '!'

    public function setSession()
    {
        if ($this->request->getPost('id')) {
            $id = $this->request->getPost('id');
            session()->set('game', $id);
            $response['success'] = false;
            $response['messages'] = "No Voucher Found";
            if (session()->game == $id) {
                $voucer = $this->voucherModel->where('category', session()->game)->first();
---
SELECT *
FROM `voucher`
WHERE `category` = '39'
 LIMIT 1

    public function selection()
    {
        if (session()->game == NULL | session()->game == "") {
            return redirect()->to(base_url());
        } else {
            $voucer = $this->voucherModel->where('category', session()->game)->findAll();
            $data = [
                'title' => "Home",
                'category' => $this->categoriesModel->find(session()->game),
                'voucer' => $voucer,
            ];
---
SELECT *
FROM `voucher`
WHERE `category` = '37'
SELECT *
FROM `voucher`
WHERE `category` = '38'